## ========= EDA ===========

1) Pandas : Data Frame applications

2) Numpy : Numerical Python All math applications

3) Matplotlib : Used for plotting

4) Seaborn : Also used for plotting

5) plotly : Also used for plotting

6) Bokhe : Also plot


## ======= ML Packages =======

1) scikit-learn : sklearn


## =======DL packages ========

1) Tensorflow : Google

2) Keras : Google

3) Pytorch : Facebook


## =======NLP Packages ========

1) NLTK : Natural Language Tool Kit

2) Scipy


## ========= BERT =============

1) Transformers : Hugging face (Google)


## =========Google models =========

1) Specific google packages


## =========Azure ML ===========

1) Azure Packages


## =========GenAI =============

1) Gemini : Google

2) ChatGPT : OpenAI


## ========= LangChain ==========

1) LangChain Packages

# $Pandas$

# Create a dataframe using list

- list === dictionary

- dictionary === list

$step-1$

#### Create a dataframe

In [2]:
import pandas as pd
names = ['Ayush','Avinash','Akash']
pd.DataFrame() # Empty dataFrame will be created # No rows and no columns

Empty DataFrame
Columns: []
Index: []

$step-2$

#### Provide the data

In [3]:
names = ['Ayush','Avinash','Akash']
pd.DataFrame(names)

         0
0    Ayush
1  Avinash
2    Akash

#### Add multiple columns

In [7]:
names = ['Ayush','Avinash','Akash']
age = [20,25,30]
pd.DataFrame(zip(names,age))
# What is the first positional arguments : data
# Second Positional Arguments : index

         0   1
0    Ayush  20
1  Avinash  25
2    Akash  30

In [9]:
names = ['Ayush','Avinash','Akash']
age = [20,25,30]
city = ['Hyd','Blr','Chenn']
pd.DataFrame(zip(names,age,city))

         0   1      2
0    Ayush  20    Hyd
1  Avinash  25    Blr
2    Akash  30  Chenn

In [10]:
names = ['Ayush','Avinash','Akash']
age = [20,25,30]
city = ['Hyd','Blr','Chenn']
pd.DataFrame(zip(names,age),city)

             0   1
Hyd      Ayush  20
Blr    Avinash  25
Chenn    Akash  30

In [11]:
names = ['Ayush','Avinash','Akash']
age = [20,25,30]
city = ['Hyd','Blr','Chenn']
data = zip(names,age)
pd.DataFrame(data,city)

             0   1
Hyd      Ayush  20
Blr    Avinash  25
Chenn    Akash  30

$step-3$

#### Provide column names

In [12]:
names = ['Ayush','Avinash','Akash']
age = [20,25,30]
city = ['Hyd','Blr','Chenn']
pd.DataFrame(zip(names,age,city),columns = ['Names','Age','City'])

     Names  Age   City
0    Ayush   20    Hyd
1  Avinash   25    Blr
2    Akash   30  Chenn

In [13]:
names = ['Ayush','Avinash','Akash']
age = [20,25,30]
city = ['Hyd','Blr','Chenn']
cols = ['Names','Age','City']
pd.DataFrame(zip(names,age,city),columns = cols)

     Names  Age   City
0    Ayush   20    Hyd
1  Avinash   25    Blr
2    Akash   30  Chenn

In [30]:
names = ['Ayush','Avinash','Akash']
age = [20,25,30]
city = ['Hyd','Blr','Chenn']

data = zip(names,age,city)
cols = ['Names','Age','City']
df = pd.DataFrame(data,columns = cols)

$step-4$

#### add column in already available dataFrame

In [31]:
type(df)

pandas.core.frame.DataFrame

- If you want to add new column

- First you need to check the number of rows in already existing dataset

- For example in above the dataframe has 3 rows

- You need to create a new list with 3 rows

- That list equate to the dataframe

In [32]:
job = ['DS','DE','DA']
df['Job'] = job

In [33]:
df

     Names  Age   City Job
0    Ayush   20    Hyd  DS
1  Avinash   25    Blr  DE
2    Akash   30  Chenn  DA

In [34]:
print(df)

     Names  Age   City Job
0    Ayush   20    Hyd  DS
1  Avinash   25    Blr  DE
2    Akash   30  Chenn  DA

$step-5$

#### update existing column

In [35]:
df['Age'] = [35,40,45]
df

     Names  Age   City Job
0    Ayush   35    Hyd  DS
1  Avinash   40    Blr  DE
2    Akash   45  Chenn  DA

$step-6$

#### Change the index

In [38]:
names = ['Ayush','Avinash','Akash']
age = [20,25,30]
city = ['Hyd','Blr','Chenn']

data = zip(names,age,city)
cols = ['Names','Age','City']
idx = ['A','B','C']
df = pd.DataFrame(data,index = idx,columns = cols)
df

     Names  Age   City
A    Ayush   20    Hyd
B  Avinash   25    Blr
C    Akash   30  Chenn

In [39]:
names = ['Ayush','Avinash','Akash','Anvi']
age = [20,25,30,35]
city = ['Hyd','Blr','Chenn','Mumbai']

data = zip(names,age,city)
cols = ['Names','Age','City']
idx = ['A','B','C','D']
df = pd.DataFrame(data,index = idx,columns = cols)
df

     Names  Age    City
A    Ayush   20     Hyd
B  Avinash   25     Blr
C    Akash   30   Chenn
D     Anvi   35  Mumbai

**Note**

- Number of list equals to **Number of columns**

- Number of values inside list equals to **Number of rows**

- When you create the data all the lists will be in same length

$step-7$

**shape**

- Number of rows

- Number of columns

In [41]:
df.shape
# Matrix format
# 4 rows and 3 columns
print("The number of rows are: ",df.shape[0])
print("The number of columns are: ",df.shape[1])

The number of rows are:  4
The number of columns are:  3

In [42]:
df.shape

(4, 3)

$step-8$

#### How to drop the column

- In order to drop column we require 3 arguments

- Column name 

         - The column name we need to mention
         
- axis

         - axis=0  **represents rows**
         
         - axis=1  **represents columns**
         
- inplace 

         - we are dropping column means we are modifying the data frame
         
         - So this modification we wand to save in same or different variable 
         
         - If you want to keep in the same variable the argument is
         **inplace=True**

In [44]:
df['Job'] = ['DS','DA','DE','FE']
df

     Names  Age    City Job
A    Ayush   20     Hyd  DS
B  Avinash   25     Blr  DA
C    Akash   30   Chenn  DE
D     Anvi   35  Mumbai  FE

In [45]:
df.drop('City',axis=1,inplace=True)

In [46]:
df

     Names  Age Job
A    Ayush   20  DS
B  Avinash   25  DA
C    Akash   30  DE
D     Anvi   35  FE

In [47]:
df.drop('Age',axis=1)
df

     Names  Age Job
A    Ayush   20  DS
B  Avinash   25  DA
C    Akash   30  DE
D     Anvi   35  FE

In [48]:
df1 = df.drop('Age',axis=1)
df1

     Names Job
A    Ayush  DS
B  Avinash  DA
C    Akash  DE
D     Anvi  FE

In [52]:
import pandas as pd
names = ['Ayush','Avinash','Akash','Anvi']
age = [20,25,30,35]
city = ['Hyd','Blr','Chenn','Mumbai']
Job = ['DA','DS','DE','FE']

data = zip(names,age,city,Job)
cols = ['Names','Age','City','job']
idx = ['A','B','C','D']
df = pd.DataFrame(data,index = idx,columns = cols)
df

     Names  Age    City job
A    Ayush   20     Hyd  DA
B  Avinash   25     Blr  DS
C    Akash   30   Chenn  DE
D     Anvi   35  Mumbai  FE

$step-9$

#### Drop multiple columns

In [53]:
names = ['Ayush','Avinash','Akash','Anvi']
age = [20,25,30,35]
city = ['Hyd','Blr','Chenn','Mumbai']
Job = ['DA','DS','DE','FE']

data = zip(names,age,city,Job)
cols = ['Names','Age','City','job']
idx = ['A','B','C','D']
df = pd.DataFrame(data,index = idx,columns = cols)
df

     Names  Age    City job
A    Ayush   20     Hyd  DA
B  Avinash   25     Blr  DS
C    Akash   30   Chenn  DE
D     Anvi   35  Mumbai  FE

In [54]:
df.drop(['City','Age'],axis=1,inplace = True)
df

     Names job
A    Ayush  DA
B  Avinash  DS
C    Akash  DE
D     Anvi  FE

$step-10$

#### Drop rows

In [55]:
names = ['Ayush','Avinash','Akash','Anvi']
age = [20,25,30,35]
city = ['Hyd','Blr','Chenn','Mumbai']
Job = ['DA','DS','DE','FE']

data = zip(names,age,city,Job)
cols = ['Names','Age','City','job']
idx = ['A','B','C','D']
df = pd.DataFrame(data,index = idx,columns = cols)
df

     Names  Age    City job
A    Ayush   20     Hyd  DA
B  Avinash   25     Blr  DS
C    Akash   30   Chenn  DE
D     Anvi   35  Mumbai  FE

In [56]:
df.drop('City',axis=0,inplace=True)

KeyError: "['City'] not found in axis"

In [57]:
df.drop('A',axis=0,inplace=True)

In [58]:
df

     Names  Age    City job
B  Avinash   25     Blr  DS
C    Akash   30   Chenn  DE
D     Anvi   35  Mumbai  FE

In [59]:
names = ['Ayush','Avinash','Akash','Anvi']
age = [20,25,30,35]
city = ['Hyd','Blr','Chenn','Mumbai']
Job = ['DA','DS','DE','FE']

data = zip(names,age,city,Job)
cols = ['Names','Age','City','job']
idx = ['A','B','C','D']
df = pd.DataFrame(data,index = idx,columns = cols)
df

     Names  Age    City job
A    Ayush   20     Hyd  DA
B  Avinash   25     Blr  DS
C    Akash   30   Chenn  DE
D     Anvi   35  Mumbai  FE

$step-11$

#### How to save the data frame

- Generally data frames are two types

- csv(Comma Separated values)

- Excel

In [60]:
# file name = data
df.to_csv('data.csv')

In [62]:
# file name = data1
df.to_csv('data1.csv',index=False)

In [64]:
df.to_excel('data2.xlsx')
df.to_excel('data3.xlsx',index=False)